emacs-init.org
#+TITLE: Emacs main =init.el= file
#+PROPERTY: header-args:emacs-lisp :tangle ./export/emacs-init.el :comments yes

* Description

This =init.el= file is the first and main (for me) configuration file for Emacs. It contains all options that I will use both in Emacs editor and my Emacs deskop environment. For my Emacs Desktop Environment set up, see [[./emacs-desktop.org]].

I will also often mention various sources, where I took some lines from.

Overall, I extensively used materials from System Crafters ([[https://www.youtube.com/watch?v=74zOY-vgkyw&list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ]]).

* Code style

Throughout configuration, I use this style:

#+begin_src emacs-lisp :tangle no

  (do 1)
  (do 2)
  (do 3)

#+end_src

Instead of:

#+begin_src emacs-lisp :tangle no

  (do (1
       2
       3))

#+end_src

As latter style is harder to edit. In first style, it's easy to move elements, add or remove, as first and last element use the same syntax as middle elements.

* Personal constants

Interesting, turns out you still can mutate a variable defined with ~defconst~, so it seems to be just a marker.

There I will collect variables that contain my personal directories and other constants. So that if anyone else would like to use my config, then it could change those values easily. 

#+begin_src emacs-lisp

    (defconst BIBLIOGRAPHY_FILES
      '("/mnt/data/library/clean/lit.bib"))

    (defconst ORG_AGENDA_FILES
      '("/mnt/data/notes/calendar.org" "/mnt/data/notes/dump.org" "/mnt/data/notes/project-todos.org" "/mnt/data/notes/todos.org" "/mnt/data/notes/07_02_2025-university_2_kurs_2_semester.org"))

    (defconst PROJECTS_DIR
      "/mnt/data/projects")

    (defconst ORG_PROJECT_CAPTURE_FILE
      "/mnt/data/notes/project-todos.org")

    (defconst MBSYNC_CONFIG_FILE
      "/mnt/data/mail/.mbsyncrc")

    (defconst MAIL_DIR
      "/mnt/data/mail/")

    (defconst MU_HOME
      "/mnt/data/mail/.muhome")

    (defconst MU4E_LOAD_PATH
      "/usr/shar/emacs/site-lisp/mu4e")

    (defconst SAVES_DIR
      "/mnt/data/misc/file-saves")

    (defconst YAS_SNIPPET_DIR
      "/mnt/data/projects/yas-snippets")

    (defconst MENTOR_HOME_DIR
      "/mnt/data/torrents/internal-rtorrent")

    (defconst MENTOR_DOWNLOADS_DIR
      "/mnt/data/torrents/download")

    (defconst MENTOR_EXTRA_CONF_FILE
      "/mnt/data/projects/configs/export/rtorrent.rc")

    (defconst FEED_FILE
      "/mnt/data/projects/configs/feeds.org")

    (defconst ORG_AUTOLOADS_DIR
      "/mnt/data/projects/org-mode/lisp")

    (defconst ORG_ROAM_DIR
      "/mnt/data/notes")

    (defconst ORG_FILES
      '( :todos "/mnt/data/notes/todos.org"
         :calendar "/mnt/data/notes/calendar.org"
         :dump "/mnt/data/notes/dump.org"))

    ;; Should be relative to =org-roam-directory= (which in my case is =ORG_ROAM_DIR=).
    (defconst ORG_ROAM_DAILIES_DIR
      "journals/")

    (defconst ORG_ATTACHMENTS_DIR
      "/mnt/data/notes/assets/")

    (defconst DATE_FORMAT
      "%d.%m.%Y")

    (defconst DATE_FORMAT_FOR_SAVE
      "%d_%m_%Y")

    (defconst TIME_FORMAT
      "%H:%M")

    (defconst TIME_FORMAT_FOR_SAVE
      "%H_%M")

    (defconst DATE_TIME_FORMAT
      (concat DATE_FORMAT " " TIME_FORMAT))

    (defconst DATE_TIME_FORMAT_FOR_SAVE
      (concat DATE_FORMAT_FOR_SAVE " " TIME_FORMAT_FOR_SAVE))

#+end_src

** Additional: my signing key

#+begin_src emacs-lisp

  (setq mml-secure-openpgp-signers '("E48F78214714E2801A0499D82AADAC169FBAD443"))

#+end_src

* Global Emacs configuration

Next code does not rely on any external packages.
 
** Global modes

#+begin_src emacs-lisp

  (column-number-mode)
  (scroll-bar-mode -1)        ; Disable visible scrollbar.
  (tool-bar-mode -1)          ; Disable the toolbar.
  (tooltip-mode -1)           ; Disable tooltips.
  (set-fringe-mode 10)        ; Give some breathing room ???.
  (menu-bar-mode -1)          ; Disable menu bar.
  (setq visible-bell t)       ; Do not beep.
  (recentf-mode t)            ; Store history of recent files.

  (global-auto-revert-mode 1) ; Watch files for changes.
  (setq global-auto-revert-non-file-buffers t) ; For, e.g., Dired.

  (add-hook 'prog-mode-hook 'display-line-numbers-mode)

  (global-subword-mode)      ; Yes! Hop in Open|Ai|Embeddings like open_ai_embeddings.

#+end_src

** Main font

#+begin_src emacs-lisp

  (set-face-attribute
   'default
   nil
   :font "JetBrainsMono Nerd Font Mono"
   :height 98
   :weight 'regular
   :slant 'normal
   :width 'normal)

#+end_src

** Miscalleneous commands

=load-prefer-newer= is taken from [[https://emacs.stackexchange.com/a/186]]. It fixes some annoying bugs, when my init config did not up

#+begin_src emacs-lisp

  (setq load-prefer-newer t)
  (setq inhibit-startup-message t) ; Disable startup screen.
  (setq mouse-autoselect-window t)
  (setq focus-follows-mouse t)

  (global-set-key (kbd "<escape>") 'keyboard-escape-quit) ; Make ESC quit prompts
  (global-unset-key (kbd "C-z")) ; Little shit.

#+end_src

** Easier window resizing

Taken from: [[https://stackoverflow.com/a/15186248]].

#+begin_src emacs-lisp

  (global-set-key (kbd "<C-up>") 'shrink-window)
  (global-set-key (kbd "<C-down>") 'enlarge-window)
  (global-set-key (kbd "<C-left>") 'enlarge-window-horizontally)
  (global-set-key (kbd "<C-right>") 'shrink-window-horizontally)

#+end_src

** Use UTF-8 as much as possible

Taken from: [[https://github.com/johanwiden/exwm-setup/blob/master/.emacs.d/config.org#use-better-defaults-also-see-lolsmacs-below]].

#+begin_src emacs-lisp

  (set-charset-priority 'unicode)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (set-language-environment "UTF-8")
  (prefer-coding-system 'utf-8)
  (setq default-process-coding-system '(utf-8-unix . utf-8-unix))
  ;; Treat clipboard input as UTF-8 string first; compound text next, etc.
  (setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))

#+end_src

** Backups

Taken from: [[https://stackoverflow.com/a/151946]].

#+begin_src emacs-lisp

  (setq backup-directory-alist `(("." . ,SAVES_DIR)))
  (setq backup-by-copying t)

  (setq delete-old-versions t
        kept-new-versions 6
        kept-old-versions 2
        version-control t)

#+end_src

** Misc

#+begin_src emacs-lisp

  (setq-default user-mail-address "ruslanpopov1512@gmail.com")

  (global-unset-key (kbd "C-x C-k"))

#+end_src

* Utility functions

#+begin_src emacs-lisp

  ;; Easier syntax for running programs.
  (defun iay/run-cmd (cmd)
    (start-process-shell-command cmd nil cmd))

#+end_src

Next function is taken from: [[http://xahlee.info/emacs/emacs/elisp_read_file_content.html]].

#+begin_src emacs-lisp

  (defun get-string-from-file (filePath)
    "Return file content as string."
    (with-temp-buffer
      (insert-file-contents filePath)
      (buffer-string)))

#+end_src

* Packages and modes

** Eshell

#+begin_src emacs-lisp

  (defun iay/eshell-aliases ()
    (interactive)
    (shell-command "alias" "rm" "echo 'error: use `trash` instead of `rm`'"))

  (add-hook 'eshell-mode-hook 'iay/eshell-aliases)

#+end_src

** Set up packages

*** =package=

#+begin_src emacs-lisp

  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

#+end_src

*** org autoload

#+begin_src emacs-lisp

  (add-to-list 'load-path ORG_AUTOLOADS_DIR)

#+end_src

*** =use-package=

#+begin_src emacs-lisp

  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

** Styling/themeing

*** Main theme

#+begin_src emacs-lisp

  (use-package modus-themes
    :config
    (load-theme 'modus-operandi t))

#+end_src

*** Mode line

I like =mood-line= , because it has an easy example on how to construct the mode line in =README= .

#+begin_src emacs-lisp

  (use-package mood-line
    :custom
    (mood-line-glyph-alist mood-line-glyphs-unicode)
    (mood-line-format mood-line-format-default-extended)

    :config
    (mood-line-mode))

#+end_src

Currently, EXWM hides header-line.

#+begin_src emacs-lisp :tangle no

  (setq-default header-line-format mode-line-format)
  (setq-default mode-line-format nil)

#+end_src

