export/emacs-init.el
;; [[file:../emacs-init.org::*Personal constants][Personal constants:1]]
(defconst BIBLIOGRAPHY_FILES
  '("/mnt/data/library/clean/lit.bib"))

(defconst ORG_AGENDA_FILES
  '("/mnt/data/notes/calendar.org" "/mnt/data/notes/dump.org" "/mnt/data/notes/project-todos.org" "/mnt/data/notes/todos.org" "/mnt/data/notes/07_02_2025-university_2_kurs_2_semester.org"))

(defconst PROJECTS_DIR
  "/mnt/data/projects")

(defconst ORG_PROJECT_CAPTURE_FILE
  "/mnt/data/notes/project-todos.org")

(defconst MBSYNC_CONFIG_FILE
  "/mnt/data/mail/.mbsyncrc")

(defconst MAIL_DIR
  "/mnt/data/mail/")

(defconst MU_HOME
  "/mnt/data/mail/.muhome")

(defconst MU4E_LOAD_PATH
  "/usr/shar/emacs/site-lisp/mu4e")

(defconst SAVES_DIR
  "/mnt/data/misc/file-saves")

(defconst YAS_SNIPPET_DIR
  "/mnt/data/projects/yas-snippets")

(defconst MENTOR_HOME_DIR
  "/mnt/data/torrents/internal-rtorrent")

(defconst MENTOR_DOWNLOADS_DIR
  "/mnt/data/torrents/download")

(defconst MENTOR_EXTRA_CONF_FILE
  "/mnt/data/projects/configs/export/rtorrent.rc")

(defconst FEED_FILE
  "/mnt/data/projects/configs/feeds.org")

(defconst ORG_AUTOLOADS_DIR
  "/mnt/data/projects/org-mode/lisp")

(defconst ORG_ROAM_DIR
  "/mnt/data/notes")

(defconst ORG_FILES
  '( :todos "/mnt/data/notes/todos.org"
     :calendar "/mnt/data/notes/calendar.org"
     :dump "/mnt/data/notes/dump.org"))

;; Should be relative to =org-roam-directory= (which in my case is =ORG_ROAM_DIR=).
(defconst ORG_ROAM_DAILIES_DIR
  "journals/")

(defconst ORG_ATTACHMENTS_DIR
  "/mnt/data/notes/assets/")

(defconst DATE_FORMAT
  "%d.%m.%Y")

(defconst DATE_FORMAT_FOR_SAVE
  "%d_%m_%Y")

(defconst TIME_FORMAT
  "%H:%M")

(defconst TIME_FORMAT_FOR_SAVE
  "%H_%M")

(defconst DATE_TIME_FORMAT
  (concat DATE_FORMAT " " TIME_FORMAT))

(defconst DATE_TIME_FORMAT_FOR_SAVE
  (concat DATE_FORMAT_FOR_SAVE " " TIME_FORMAT_FOR_SAVE))
;; Personal constants:1 ends here

;; [[file:../emacs-init.org::*Additional: my signing key][Additional: my signing key:1]]
(setq mml-secure-openpgp-signers '("E48F78214714E2801A0499D82AADAC169FBAD443"))
;; Additional: my signing key:1 ends here

;; [[file:../emacs-init.org::*Global modes][Global modes:1]]
(column-number-mode)
(scroll-bar-mode -1)        ; Disable visible scrollbar.
(tool-bar-mode -1)          ; Disable the toolbar.
(tooltip-mode -1)           ; Disable tooltips.
(set-fringe-mode 10)        ; Give some breathing room ???.
(menu-bar-mode -1)          ; Disable menu bar.
(setq visible-bell t)       ; Do not beep.
(recentf-mode t)            ; Store history of recent files.

(global-auto-revert-mode 1) ; Watch files for changes.
(setq global-auto-revert-non-file-buffers t) ; For, e.g., Dired.

(add-hook 'prog-mode-hook 'display-line-numbers-mode)

(global-subword-mode)      ; Yes! Hop in Open|Ai|Embeddings like open_ai_embeddings.
;; Global modes:1 ends here

;; [[file:../emacs-init.org::*Main font][Main font:1]]
(set-face-attribute
 'default
 nil
 :font "JetBrainsMono Nerd Font Mono"
 :height 98
 :weight 'regular
 :slant 'normal
 :width 'normal)
;; Main font:1 ends here

;; [[file:../emacs-init.org::*Miscalleneous commands][Miscalleneous commands:1]]
(setq load-prefer-newer t)
(setq inhibit-startup-message t) ; Disable startup screen.
(setq mouse-autoselect-window t)
(setq focus-follows-mouse t)

(global-set-key (kbd "<escape>") 'keyboard-escape-quit) ; Make ESC quit prompts
(global-unset-key (kbd "C-z")) ; Little shit.
;; Miscalleneous commands:1 ends here

;; [[file:../emacs-init.org::*Easier window resizing][Easier window resizing:1]]
(global-set-key (kbd "<C-up>") 'shrink-window)
(global-set-key (kbd "<C-down>") 'enlarge-window)
(global-set-key (kbd "<C-left>") 'enlarge-window-horizontally)
(global-set-key (kbd "<C-right>") 'shrink-window-horizontally)
;; Easier window resizing:1 ends here

;; [[file:../emacs-init.org::*Use UTF-8 as much as possible][Use UTF-8 as much as possible:1]]
(set-charset-priority 'unicode)
(set-default-coding-systems 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(set-language-environment "UTF-8")
(prefer-coding-system 'utf-8)
(setq default-process-coding-system '(utf-8-unix . utf-8-unix))
;; Treat clipboard input as UTF-8 string first; compound text next, etc.
(setq x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING))
;; Use UTF-8 as much as possible:1 ends here

;; [[file:../emacs-init.org::*Backups][Backups:1]]
(setq backup-directory-alist `(("." . ,SAVES_DIR)))
(setq backup-by-copying t)

(setq delete-old-versions t
      kept-new-versions 6
      kept-old-versions 2
      version-control t)
;; Backups:1 ends here

;; [[file:../emacs-init.org::*Misc][Misc:1]]
(setq-default user-mail-address "ruslanpopov1512@gmail.com")

(global-unset-key (kbd "C-x C-k"))
;; Misc:1 ends here

;; [[file:../emacs-init.org::*Utility functions][Utility functions:1]]
;; Easier syntax for running programs.
(defun iay/run-cmd (cmd)
  (start-process-shell-command cmd nil cmd))
;; Utility functions:1 ends here

;; [[file:../emacs-init.org::*Utility functions][Utility functions:2]]
(defun get-string-from-file (filePath)
  "Return file content as string."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
;; Utility functions:2 ends here

;; [[file:../emacs-init.org::*Eshell][Eshell:1]]
(defun iay/eshell-aliases ()
  (interactive)
  (shell-command "alias" "rm" "echo 'error: use `trash` instead of `rm`'"))

(add-hook 'eshell-mode-hook 'iay/eshell-aliases)
;; Eshell:1 ends here

;; [[file:../emacs-init.org::*=package=][=package=:1]]
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)

(unless package-archive-contents
  (package-refresh-contents))
;; =package=:1 ends here

;; [[file:../emacs-init.org::*org autoload][org autoload:1]]
(add-to-list 'load-path ORG_AUTOLOADS_DIR)
;; org autoload:1 ends here

;; [[file:../emacs-init.org::*=use-package=][=use-package=:1]]
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
;; =use-package=:1 ends here

;; [[file:../emacs-init.org::*Main theme][Main theme:1]]
(use-package modus-themes
  :config
  (load-theme 'modus-operandi t))
;; Main theme:1 ends here

;; [[file:../emacs-init.org::*Mode line][Mode line:1]]
(use-package mood-line
  :custom
  (mood-line-glyph-alist mood-line-glyphs-unicode)
  (mood-line-format mood-line-format-default-extended)

  :config
  (mood-line-mode))
;; Mode line:1 ends here
