emacs-init.org
*** Paddings

#+begin_src emacs-lisp

  (use-package spacious-padding
    :custom
    (spacious-padding-widths
     '( :internal-border-width 15
        :header-line-width 4
        :mode-line-width 6
        :tab-width 4
        :right-divider-width 30
        :scroll-bar-width 8
        :fringe-width 8))
    (spacious-padding-subtle-mode-line
     `( :mode-line-active 'default
        :mode-line-inactive vertical-border))

    :config
    (spacious-padding-mode 1))

#+end_src

*** Minibuffer :unused:

#+begin_src emacs-lisp :tangle no

  (use-package mini-frame
    :config
    (mini-frame-mode 1))

#+end_src

*** Rainbow delimiters

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook
    (prog-mode . rainbow-delimiters-mode))

#+end_src

*** Icons

Taken from: [[https://github.com/daviwil/emacs-from-scratch/blob/82d24eea516e7799ead20cf068542e2b5ecb270e/init.el]].

*NOTE*: The first time you load your configuration on a new machine, you'll need to run the following command interactively so that mode line icons display correctly:

: M-x all-the-icons-install-fonts

#+begin_src emacs-lisp

  (use-package all-the-icons
    :config
    (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
    (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append))

  (use-package all-the-icons-dired
    :hook
    (dired-mode . all-the-icons-dired-mode))

#+end_src

** Packages for using the computer

Like in a desktop environment.

*** =dired=

To reduce buffer count I used: [[https://stackoverflow.com/a/68952245]].

#+begin_src emacs-lisp

  (setq dired-listing-switches "-agho --group-directories-first")
                                          ;(setf dired-kill-when-opening-new-dired-buffer t)

#+end_src

Taken a lot from: [[https://github.com/daviwil/emacs-from-scratch/blob/8c302a79bf5700f6ef0279a3daeeb4123ae8bd59/Emacs.org#dired]].

Something makes dired go insane when switching dirs.

#+begin_src emacs-lisp

  ;; IDK, why these 2 don't work.
  ;; (use-package dired)
  ;; (use-package dired-single)

  ;; (use-package dired-open
  ;;   :config
  ;;   (add-to-list 'dired-open-functions #'dired-open-xdg t))

  ;; (use-package dired-hide-dotfiles
  ;;   :hook
  ;;   (dired-mode . dired-hide-dotfiles-mode)

  ;;   :config
  ;;   (evil-define-key 'normal dired-mode-map "H" 'dired-hide-dotfiles-mode))

#+end_src

*** Multi-term

Several terminals. Taken from: [[https://www.emacswiki.org/emacs/MultiTerm]].

#+begin_src emacs-lisp

  (use-package multi-term
    :custom
    (multi-term-program "/bin/zsh"))

#+end_src

*** Reading documents

**** =doc-view=

#+begin_src emacs-lisp

  (setq doc-view-resolution 300)

#+end_src

**** =pdf-tools=

#+begin_src emacs-lisp

  (use-package pdf-tools
    :config
    (pdf-loader-install))

#+end_src

*** Social

**** Email

Taken a lot from:

- [[https://www.youtube.com/watch?v=yZRyEhi4y44&list=PLEoMzSkcN8oM-kA19xOQc8s0gr0PpFGJQ&index=4]].
- [[https://www.youtube.com/watch?v=olXpfaSnf0o&list=PLEoMzSkcN8oM-kA19xOQc8s0gr0PpFGJQ&index=5]].

#+begin_src emacs-lisp

  (use-package mu4e
    :ensure
    nil

    ;; :defer
    ;; 20

    :load-path
    MU4E_LOAD_PATH

    :custom
    (mu4e-change-filenames-when-moving t)
    (mu4e-update-interval (* 5 60)) ; Every 5 minutes.
    (mu4e-get-mail-command (format "mbsync -a --config %s" MBSYNC_CONFIG_FILE))
    (mu4e-maildir MAIL_DIR)
    (mu4e-mu-home MU_HOME)
    (mu4e-compose-format-flowed t)
    (message-send-mail-function 'message-send-mail-with-sendmail)
    (sendmail-program "/usr/bin/msmtp")
    (send-mail-function 'smtpmail-send-it)
    (message-sendmail-f-is-evil t)
    (message-sendmail-extra-arguments '("--read-envelope-from"))

    :config
    (require 'mu4e-org)
    (mu4e t)
    (setq mu4e-contexts
          (list
           (make-mu4e-context
            :name
            "gmail"

            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/gmail" (mu4e-message-field msg :maildir))))

            :vars `((user-mail-address . "ruslanpopov1512@gmail.com")
                    (user-full-name    . "Ruslan Popov")
                    (mu4e-drafts-folder  . "/gmail/[Gmail]/Drafts")
                    (mu4e-sent-folder  . "/gmail/[Gmail]/Sent Mail")
                    (mu4e-refile-folder  . "/gmail/[Gmail]/All Mail")
                    (mu4e-trash-folder  . "/gmail/[Gmail]/Trash")))
           (make-mu4e-context
            :name
            "new-uni"

            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/uni-new" (mu4e-message-field msg :maildir))))

            :vars `((user-mail-address . "popov_r@365.dnu.edu.ua")
                    (user-full-name    . "Ruslan Popov")
                    (mu4e-drafts-folder  . "/uni-new/Drafts")
                    (mu4e-sent-folder  . "/uni-new/Sent Items")
                    ;; (mu4e-refile-folder  . "/uni-new/inbox")
                    (mu4e-trash-folder  . "/uni-new/Trash")))
           (make-mu4e-context
            :name
            "old-uni"

            :match-func
            (lambda (msg)
              (when msg
                (string-prefix-p "/uni-old" (mu4e-message-field msg :maildir))))

            :vars `((user-mail-address . "popov_ro@ffeks.dnu.edu.ua")
                    (user-full-name    . "Ruslan Popov")
                    (mu4e-drafts-folder  . "/uni-old/Drafts")
                    (mu4e-sent-folder  . "/uni-old/Sent Items")
                    ;; (mu4e-refile-folder  . "/uni-old/inbox")
                    (mu4e-trash-folder  . "/uni-old/Trash"))))))

#+end_src

Next snippet of code, taken from [[https://l2dy.github.io/notes/Emacs/mu4e/Prefer-Plain-Text-in-mu4e]], should allow to prefer plain text over HTML in email rendering.

#+begin_src emacs-lisp

  (with-eval-after-load "mm-decode"
    (add-to-list 'mm-discouraged-alternatives "text/html")
    (add-to-list 'mm-discouraged-alternatives "text/richtext"))

#+end_src

#+begin_src emacs-lisp

  (use-package mu4e-alert
    :config
    (mu4e-alert-set-default-style 'notifications)
    (add-hook 'after-init-hook #'mu4e-alert-enable-notifications))

#+end_src

**** Telegram

#+begin_src emacs-lisp

  (use-package telega
    :custom
    (telega-server-libs-prefix "/usr")

    :config
    (define-key global-map (kbd "C-c t") telega-prefix-map)
    (telega-notifications-mode 1))

#+end_src

**** RSS/Atom

#+begin_src emacs-lisp

  (use-package elfeed
    :bind
    ("C-x f" . elfeed)

    :custom
    (elfeed-search-filter "@6-months-ago")
    (elfeed-search-date-format `(,DATE_TIME_FORMAT 13 :left)))

#+end_src

I don't really liked that one.
    
#+begin_src emacs-lisp :tangle no

  (use-package elfeed-goodies
    :config
    (elfeed-goodies/setup))

#+end_src

#+begin_src emacs-lisp

  (use-package elfeed-org
    :custom
    (rmh-elfeed-org-files (list FEED_FILE))

    :config
    (elfeed-org))

#+end_src

*** Torrent

#+begin_src emacs-lisp

  (use-package transmission)

#+end_src

Old:

#+begin_src emacs-lisp :tangle no

  (use-package mentor
    :custom
    (mentor-home-dir MENTOR_HOME_DIR)
    (mentor-rtorrent-extra-conf (get-string-from-file MENTOR_EXTRA_CONF_FILE))
    (mentor-rtorrent-download-directory MENTOR_DOWNLOADS_DIR))

#+end_src

*** Copy/pasting

#+begin_src emacs-lisp

  (use-package xclip
    :config
    (xclip-mode 1))

#+end_src

** Ivy-counsel-swiper trio

*** =ivy=

=ivy= is a completion framework.

#+begin_src emacs-lisp

  (use-package ivy
    :bind
    (:map ivy-minibuffer-map
          ("TAB" . ivy-alt-done)	
          ("C-l" . ivy-alt-done)
          ("C-j" . ivy-next-line)
          ("C-k" . ivy-previous-line)
          :map ivy-switch-buffer-map
          ("C-k" . ivy-previous-line)
          ("C-l" . ivy-done)
          ("C-d" . ivy-switch-buffer-kill)
          :map ivy-reverse-i-search-map
          ("C-k" . ivy-previous-line)
          ("C-d" . ivy-reverse-i-search-kill))

    :custom
    (ivy-count-format "(%d/%d) ")
    (ivy-use-virtual-buffers t)

    :config
    (ivy-mode))

#+end_src

*** =ivy-rich=

Better looking interface for =ivy=.

Basic config taken from: [[https://github.com/Yevgnen/ivy-rich?tab=readme-ov-file#basic-usages]].

#+begin_src emacs-lisp

  (use-package ivy-rich
    :config
    (ivy-rich-mode))

  (setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)

#+end_src

