export/emacs-init.el

;; [[file:../emacs-init.org::*Paddings][Paddings:1]]
(use-package spacious-padding
  :custom
  (spacious-padding-widths
   '( :internal-border-width 15
      :header-line-width 4
      :mode-line-width 6
      :tab-width 4
      :right-divider-width 30
      :scroll-bar-width 8
      :fringe-width 8))
  (spacious-padding-subtle-mode-line
   `( :mode-line-active 'default
      :mode-line-inactive vertical-border))

  :config
  (spacious-padding-mode 1))
;; Paddings:1 ends here

;; [[file:../emacs-init.org::*Rainbow delimiters][Rainbow delimiters:1]]
(use-package rainbow-delimiters
  :hook
  (prog-mode . rainbow-delimiters-mode))
;; Rainbow delimiters:1 ends here

;; [[file:../emacs-init.org::*Icons][Icons:1]]
(use-package all-the-icons
  :config
  (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
  (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append))

(use-package all-the-icons-dired
  :hook
  (dired-mode . all-the-icons-dired-mode))
;; Icons:1 ends here

;; [[file:../emacs-init.org::*=dired=][=dired=:1]]
(setq dired-listing-switches "-agho --group-directories-first")
                                        ;(setf dired-kill-when-opening-new-dired-buffer t)
;; =dired=:1 ends here

;; [[file:../emacs-init.org::*=dired=][=dired=:2]]
;; IDK, why these 2 don't work.
;; (use-package dired)
;; (use-package dired-single)

;; (use-package dired-open
;;   :config
;;   (add-to-list 'dired-open-functions #'dired-open-xdg t))

;; (use-package dired-hide-dotfiles
;;   :hook
;;   (dired-mode . dired-hide-dotfiles-mode)

;;   :config
;;   (evil-define-key 'normal dired-mode-map "H" 'dired-hide-dotfiles-mode))
;; =dired=:2 ends here

;; [[file:../emacs-init.org::*Multi-term][Multi-term:1]]
(use-package multi-term
  :custom
  (multi-term-program "/bin/zsh"))
;; Multi-term:1 ends here

;; [[file:../emacs-init.org::*=doc-view=][=doc-view=:1]]
(setq doc-view-resolution 300)
;; =doc-view=:1 ends here

;; [[file:../emacs-init.org::*=pdf-tools=][=pdf-tools=:1]]
(use-package pdf-tools
  :config
  (pdf-loader-install))
;; =pdf-tools=:1 ends here

;; [[file:../emacs-init.org::*Email][Email:1]]
(use-package mu4e
  :ensure
  nil

  ;; :defer
  ;; 20

  :load-path
  MU4E_LOAD_PATH

  :custom
  (mu4e-change-filenames-when-moving t)
  (mu4e-update-interval (* 5 60)) ; Every 5 minutes.
  (mu4e-get-mail-command (format "mbsync -a --config %s" MBSYNC_CONFIG_FILE))
  (mu4e-maildir MAIL_DIR)
  (mu4e-mu-home MU_HOME)
  (mu4e-compose-format-flowed t)
  (message-send-mail-function 'message-send-mail-with-sendmail)
  (sendmail-program "/usr/bin/msmtp")
  (send-mail-function 'smtpmail-send-it)
  (message-sendmail-f-is-evil t)
  (message-sendmail-extra-arguments '("--read-envelope-from"))

  :config
  (require 'mu4e-org)
  (mu4e t)
  (setq mu4e-contexts
        (list
         (make-mu4e-context
          :name
          "gmail"

          :match-func
          (lambda (msg)
            (when msg
              (string-prefix-p "/gmail" (mu4e-message-field msg :maildir))))

          :vars `((user-mail-address . "ruslanpopov1512@gmail.com")
                  (user-full-name    . "Ruslan Popov")
                  (mu4e-drafts-folder  . "/gmail/[Gmail]/Drafts")
                  (mu4e-sent-folder  . "/gmail/[Gmail]/Sent Mail")
                  (mu4e-refile-folder  . "/gmail/[Gmail]/All Mail")
                  (mu4e-trash-folder  . "/gmail/[Gmail]/Trash")))
         (make-mu4e-context
          :name
          "new-uni"

          :match-func
          (lambda (msg)
            (when msg
              (string-prefix-p "/uni-new" (mu4e-message-field msg :maildir))))

          :vars `((user-mail-address . "popov_r@365.dnu.edu.ua")
                  (user-full-name    . "Ruslan Popov")
                  (mu4e-drafts-folder  . "/uni-new/Drafts")
                  (mu4e-sent-folder  . "/uni-new/Sent Items")
                  ;; (mu4e-refile-folder  . "/uni-new/inbox")
                  (mu4e-trash-folder  . "/uni-new/Trash")))
         (make-mu4e-context
          :name
          "old-uni"

          :match-func
          (lambda (msg)
            (when msg
              (string-prefix-p "/uni-old" (mu4e-message-field msg :maildir))))

          :vars `((user-mail-address . "popov_ro@ffeks.dnu.edu.ua")
                  (user-full-name    . "Ruslan Popov")
                  (mu4e-drafts-folder  . "/uni-old/Drafts")
                  (mu4e-sent-folder  . "/uni-old/Sent Items")
                  ;; (mu4e-refile-folder  . "/uni-old/inbox")
                  (mu4e-trash-folder  . "/uni-old/Trash"))))))
;; Email:1 ends here

;; [[file:../emacs-init.org::*Email][Email:2]]
(with-eval-after-load "mm-decode"
  (add-to-list 'mm-discouraged-alternatives "text/html")
  (add-to-list 'mm-discouraged-alternatives "text/richtext"))
;; Email:2 ends here

;; [[file:../emacs-init.org::*Email][Email:3]]
(use-package mu4e-alert
  :config
  (mu4e-alert-set-default-style 'notifications)
  (add-hook 'after-init-hook #'mu4e-alert-enable-notifications))
;; Email:3 ends here

;; [[file:../emacs-init.org::*Telegram][Telegram:1]]
(use-package telega
  :custom
  (telega-server-libs-prefix "/usr")

  :config
  (define-key global-map (kbd "C-c t") telega-prefix-map)
  (telega-notifications-mode 1))
;; Telegram:1 ends here

;; [[file:../emacs-init.org::*RSS/Atom][RSS/Atom:1]]
(use-package elfeed
  :bind
  ("C-x f" . elfeed)

  :custom
  (elfeed-search-filter "@6-months-ago")
  (elfeed-search-date-format `(,DATE_TIME_FORMAT 13 :left)))
;; RSS/Atom:1 ends here

;; [[file:../emacs-init.org::*RSS/Atom][RSS/Atom:3]]
(use-package elfeed-org
  :custom
  (rmh-elfeed-org-files (list FEED_FILE))

  :config
  (elfeed-org))
;; RSS/Atom:3 ends here

;; [[file:../emacs-init.org::*Torrent][Torrent:1]]
(use-package transmission)
;; Torrent:1 ends here

;; [[file:../emacs-init.org::*Copy/pasting][Copy/pasting:1]]
(use-package xclip
  :config
  (xclip-mode 1))
;; Copy/pasting:1 ends here

;; [[file:../emacs-init.org::*=ivy=][=ivy=:1]]
(use-package ivy
  :bind
  (:map ivy-minibuffer-map
        ("TAB" . ivy-alt-done)	
        ("C-l" . ivy-alt-done)
        ("C-j" . ivy-next-line)
        ("C-k" . ivy-previous-line)
        :map ivy-switch-buffer-map
        ("C-k" . ivy-previous-line)
        ("C-l" . ivy-done)
        ("C-d" . ivy-switch-buffer-kill)
        :map ivy-reverse-i-search-map
        ("C-k" . ivy-previous-line)
        ("C-d" . ivy-reverse-i-search-kill))

  :custom
  (ivy-count-format "(%d/%d) ")
  (ivy-use-virtual-buffers t)

  :config
  (ivy-mode))
;; =ivy=:1 ends here

;; [[file:../emacs-init.org::*=ivy-rich=][=ivy-rich=:1]]
(use-package ivy-rich
  :config
  (ivy-rich-mode))

(setcdr (assq t ivy-format-functions-alist) #'ivy-format-function-line)
;; =ivy-rich=:1 ends here

;; [[file:../emacs-init.org::*=counsel=][=counsel=:1]]
(use-package counsel
  :after ivy

  :bind
  ("M-x" . counsel-M-x)
