emacs-init.org
*** =counsel=

=counsel= is a collection of enhanced Emacs commands.

#+begin_src emacs-lisp

  (use-package counsel
    :after ivy

    :bind
    ("M-x" . counsel-M-x)
    ("C-x b" . counsel-ibuffer)
    ("C-x C-f" . counsel-find-file)

    :custom
    (ivy-initial-input-alist nil) ;; Don't start with ^. DOES NOT WORK

    :config
    (counsel-mode))

#+end_src

*** =prescient=

As said in [[https://www.youtube.com/watch?v=T9kygXveEz0]], it should be loaded after =counsel=.

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after
    counsel

    ;; :custom
    ;; (prescient-sort-length-enable nil)

    :config
    (ivy-prescient-mode 1))

  (use-package company-prescient
    :after
    company

    :config
    (company-prescient-mode 1))

  (prescient-persist-mode 1)

#+end_src

*** =swiper=

=swiper= is enhanced search.

#+begin_src emacs-lisp

  (use-package swiper
    :after ivy

    :bind
    ("C-s" . swiper)
    ("C-r" . swiper))

#+end_src

** Parenthesis

*** =smartparens=

#+begin_src emacs-lisp

  (use-package smartparens
    :config
    (require 'smartparens-config) ; Yes, not `use-package`.
    (smartparens-global-mode t))

  ;; Taken from: [[https://stackoverflow.com/a/35469843]].
  (with-eval-after-load 'smartparens
    (sp-with-modes
        '(c++-mode objc-mode c-mode)
      (sp-local-pair "{" nil :post-handlers '(:add ("||\n[i]" "RET")))))

#+end_src

*** Auto indent new lines

#+begin_src emacs-lisp

  (defun indent-between-pair (&rest _ignored)
    (newline)
    (indent-according-to-mode)
    (forward-line -1)
    (indent-according-to-mode))

  (sp-local-pair 'prog-mode "{" nil :post-handlers '((indent-between-pair "RET")))
  (sp-local-pair 'prog-mode "[" nil :post-handlers '((indent-between-pair "RET")))
  (sp-local-pair 'prog-mode "(" nil :post-handlers '((indent-between-pair "RET")))

#+end_src

** LaTeX

*** =auctex= and general config

Setting up =latex-preview-pane-mode= is taken from: [[https://emacs.stackexchange.com/a/21590]].

#+begin_src emacs-lisp

  (use-package auctex)

  (setq-default TeX-brace-indent-level 4)
  (setq-default LaTeX-indent-level 4)

  (setq-default TeX-engine 'xetex)
  (setq-default TeX-PDF-mode t)

  (eval-after-load "tex"
    '(add-to-list
      'TeX-view-program-list
      '("preview-pane-mode"
        latex-preview-pane-mode)))

#+end_src

*** =latex-preview-pane=

#+begin_src emacs-lisp

  (use-package latex-preview-pane
    :config
    (latex-preview-pane-enable))

#+end_src

*** General config

#+begin_src emacs-lisp

  (setq org-export-with-toc nil)
  (setq org-latex-title-command "\\maketitle")

  (setq org-latex-compiler "xelatex")

                                          ; TODO: MOVE TO ORG.
  ;; (add-to-list 'org-latex-classes
  ;; 	     '("inanyan-paper"
  ;; 	       "\\documentclass{inanyan-paper}
  ;; 		[NO-DEFAULT-PACKAGES]
  ;; 		[NO-PACKAGES] "
  ;; 	       ("\\section{%s}" . "\\section*{%s}")
  ;; 	       ("\\subsection{%s}" . "\\subsection*{%s}")
  ;; 	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  ;; 	       ("\\paragraph{%s}" . "\\paragraph*{%s}")
  ;; 	       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

  ;; (add-to-list 'org-latex-classes
  ;; 	     '("inanyan-paper-new"
  ;; 	       "\\documentclass{inanyan-paper-new}
  ;; 		[NO-DEFAULT-PACKAGES]
  ;; 		[NO-PACKAGES] "
  ;; 	       ("\\section{%s}" . "\\section*{%s}")
  ;; 	       ("\\subsection{%s}" . "\\subsection*{%s}")
  ;; 	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
  ;; 	       ("\\paragraph{%s}" . "\\paragraph*{%s}")
  ;; 	       ("\\
  ;; subparagraph{%s}" . "\\subparagraph*{%s}")))

#+end_src

** Help packages

*** =which-key=

It's a panel popup when you start a keybinding.

#+begin_src emacs-lisp

  (use-package which-key
    :custom
    (which-key-idle-delay 0.3)

    :config
    (which-key-mode))

#+end_src

*** =helpful=

Improved Emacs help buffer.

#+begin_src emacs-lisp

  (use-package helpful
    :commands
    (helpful-callable helpful-variable helpful-command helpful-key)

    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)

    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Org

*** =org=

Org is installed by default in Emacs, if I remember correctly, but it's better to use external link for downloading org, which was specified in =package-lists=.

The setup of ORG mode is taken a lot from these resources:

- [[https://github.com/daviwil/emacs-from-scratch/blob/1a13fcf0dd6afb41fce71bf93c5571931999fed8/init.el]]
- [[https://zzamboni.org/post/beautifying-org-mode-in-emacs]]

#+begin_src emacs-lisp

  (use-package org
    :hook
    (org-mode . org-indent-mode)
    (org-mode . visual-line-mode)
    (org-babel-after-execute . org-link-preview-refresh)

    :bind
    ("C-c c" . org-capture)
    ("C-c a" . org-agenda)
    ("C-c l" . org-store-link)

    :custom
    (org-attach-id-dir ORG_ATTACHMENTS_DIR)
    (org-ellipsis " ▾")
    (org-startup-with-inline-images t)
    (org-todo-keywords '((sequence "TODO" "DOING" "|" "DONE" "NOTP")))
    (org-log-done t)
    (org-agenda-files ORG_AGENDA_FILES)
    (org-agenda-start-with-log-mode t)
    (org-log-into-drawer t)
    (org-auto-tangle-default t))

  (advice-add 'org-refile :after 'org-save-all-org-buffers) ; As by default, when you refile, files are not saved.

#+end_src

Full Org configuration is presented in section Org.

*** =doct= and captures

=doct= is used for declarative =org-capture= templates.

#+begin_src emacs-lisp

  (use-package doct)

  (global-set-key (kbd "M-q") 'org-capture)

  (setq
   org-capture-templates
   (doct `(( "TODO" :keys "t"
  	   :type entry
  	   :template "* TODO %?\n%U\n%a\n%i\n"
      	   :headline "Active"
      	   :empty-lines 1
  	   :file ,(plist-get ORG_FILES :todos))
  	 ( "Calendar entry" :keys "c"
  	   :type entry
  	   :template "* TODO %?\n%U\n%a\n%i\n"
      	   :headline "Active"
      	   :empty-lines 1
  	   :file ,(plist-get ORG_FILES :calendar))
  	 ( "Dump" :keys "d"
  	   :type entry
  	   :template "* %?\n%U\n%a\n%i\n"
      	   :headline "Active"
      	   :empty-lines 1
  	   :file ,(plist-get ORG_FILES :dump)))))

#+end_src

*** =org-babel=

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (setq org-confirm-babel-evaluate nil)

#+end_src

*** =org-autolist=

Better handling of lists. (Like, when you type =RET= , you would like to insert a new item).

#+begin_src emacs-lisp

  (use-package org-autolist
    :hook
    (org-mode . org-autolist-mode))

#+end_src

*** =org-bullets=

#+begin_src emacs-lisp

  (use-package org-bullets
    :after org

    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

*** =org-auto-tangle=

Automatically tangle files on save. Well, I'm not sure if a whole package is needed for this...

#+begin_src emacs-lisp

  (use-package org-auto-tangle
    :hook
    (org-mode . org-auto-tangle-mode))

#+end_src

*** =org-appear=

#+begin_src emacs-lisp

  (use-package org-appear
    :hook
    (org-mode . org-appear-mode))

#+end_src

*** =org-mime=

#+begin_src emacs-lisp

  (use-package org-mime
    ;; :hook
    ;; (message-send . org-mime-htmlize)
    :custom
    (org-mime-export-options '(:section-numbers nil :with-author nil :with-toc nil)))

#+end_src

