export/emacs-init.el
  ("C-x b" . counsel-ibuffer)
  ("C-x C-f" . counsel-find-file)

  :custom
  (ivy-initial-input-alist nil) ;; Don't start with ^. DOES NOT WORK

  :config
  (counsel-mode))
;; =counsel=:1 ends here

;; [[file:../emacs-init.org::*=prescient=][=prescient=:1]]
(use-package ivy-prescient
  :after
  counsel

  ;; :custom
  ;; (prescient-sort-length-enable nil)

  :config
  (ivy-prescient-mode 1))

(use-package company-prescient
  :after
  company

  :config
  (company-prescient-mode 1))

(prescient-persist-mode 1)
;; =prescient=:1 ends here

;; [[file:../emacs-init.org::*=swiper=][=swiper=:1]]
(use-package swiper
  :after ivy

  :bind
  ("C-s" . swiper)
  ("C-r" . swiper))
;; =swiper=:1 ends here

;; [[file:../emacs-init.org::*=smartparens=][=smartparens=:1]]
(use-package smartparens
  :config
  (require 'smartparens-config) ; Yes, not `use-package`.
  (smartparens-global-mode t))

;; Taken from: [[https://stackoverflow.com/a/35469843]].
(with-eval-after-load 'smartparens
  (sp-with-modes
      '(c++-mode objc-mode c-mode)
    (sp-local-pair "{" nil :post-handlers '(:add ("||\n[i]" "RET")))))
;; =smartparens=:1 ends here

;; [[file:../emacs-init.org::*Auto indent new lines][Auto indent new lines:1]]
(defun indent-between-pair (&rest _ignored)
  (newline)
  (indent-according-to-mode)
  (forward-line -1)
  (indent-according-to-mode))

(sp-local-pair 'prog-mode "{" nil :post-handlers '((indent-between-pair "RET")))
(sp-local-pair 'prog-mode "[" nil :post-handlers '((indent-between-pair "RET")))
(sp-local-pair 'prog-mode "(" nil :post-handlers '((indent-between-pair "RET")))
;; Auto indent new lines:1 ends here

;; [[file:../emacs-init.org::*=auctex= and general config][=auctex= and general config:1]]
(use-package auctex)

(setq-default TeX-brace-indent-level 4)
(setq-default LaTeX-indent-level 4)

(setq-default TeX-engine 'xetex)
(setq-default TeX-PDF-mode t)

(eval-after-load "tex"
  '(add-to-list
    'TeX-view-program-list
    '("preview-pane-mode"
      latex-preview-pane-mode)))
;; =auctex= and general config:1 ends here

;; [[file:../emacs-init.org::*=latex-preview-pane=][=latex-preview-pane=:1]]
(use-package latex-preview-pane
  :config
  (latex-preview-pane-enable))
;; =latex-preview-pane=:1 ends here

;; [[file:../emacs-init.org::*General config][General config:1]]
(setq org-export-with-toc nil)
(setq org-latex-title-command "\\maketitle")

(setq org-latex-compiler "xelatex")

                                        ; TODO: MOVE TO ORG.
;; (add-to-list 'org-latex-classes
;; 	     '("inanyan-paper"
;; 	       "\\documentclass{inanyan-paper}
;; 		[NO-DEFAULT-PACKAGES]
;; 		[NO-PACKAGES] "
;; 	       ("\\section{%s}" . "\\section*{%s}")
;; 	       ("\\subsection{%s}" . "\\subsection*{%s}")
;; 	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
;; 	       ("\\paragraph{%s}" . "\\paragraph*{%s}")
;; 	       ("\\subparagraph{%s}" . "\\subparagraph*{%s}")))

;; (add-to-list 'org-latex-classes
;; 	     '("inanyan-paper-new"
;; 	       "\\documentclass{inanyan-paper-new}
;; 		[NO-DEFAULT-PACKAGES]
;; 		[NO-PACKAGES] "
;; 	       ("\\section{%s}" . "\\section*{%s}")
;; 	       ("\\subsection{%s}" . "\\subsection*{%s}")
;; 	       ("\\subsubsection{%s}" . "\\subsubsection*{%s}")
;; 	       ("\\paragraph{%s}" . "\\paragraph*{%s}")
;; 	       ("\\
;; subparagraph{%s}" . "\\subparagraph*{%s}")))
;; General config:1 ends here

;; [[file:../emacs-init.org::*=which-key=][=which-key=:1]]
(use-package which-key
  :custom
  (which-key-idle-delay 0.3)

  :config
  (which-key-mode))
;; =which-key=:1 ends here

;; [[file:../emacs-init.org::*=helpful=][=helpful=:1]]
(use-package helpful
  :commands
  (helpful-callable helpful-variable helpful-command helpful-key)

  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)

  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
;; =helpful=:1 ends here

;; [[file:../emacs-init.org::*=org=][=org=:1]]
(use-package org
  :hook
  (org-mode . org-indent-mode)
  (org-mode . visual-line-mode)
  (org-babel-after-execute . org-link-preview-refresh)

  :bind
  ("C-c c" . org-capture)
  ("C-c a" . org-agenda)
  ("C-c l" . org-store-link)

  :custom
  (org-attach-id-dir ORG_ATTACHMENTS_DIR)
  (org-ellipsis " ▾")
  (org-startup-with-inline-images t)
  (org-todo-keywords '((sequence "TODO" "DOING" "|" "DONE" "NOTP")))
  (org-log-done t)
  (org-agenda-files ORG_AGENDA_FILES)
  (org-agenda-start-with-log-mode t)
  (org-log-into-drawer t)
  (org-auto-tangle-default t))

(advice-add 'org-refile :after 'org-save-all-org-buffers) ; As by default, when you refile, files are not saved.
;; =org=:1 ends here

;; [[file:../emacs-init.org::*=doct= and captures][=doct= and captures:1]]
(use-package doct)

(global-set-key (kbd "M-q") 'org-capture)

(setq
 org-capture-templates
 (doct `(( "TODO" :keys "t"
  	 :type entry
  	 :template "* TODO %?\n%U\n%a\n%i\n"
      	 :headline "Active"
      	 :empty-lines 1
  	 :file ,(plist-get ORG_FILES :todos))
       ( "Calendar entry" :keys "c"
  	 :type entry
  	 :template "* TODO %?\n%U\n%a\n%i\n"
      	 :headline "Active"
      	 :empty-lines 1
  	 :file ,(plist-get ORG_FILES :calendar))
       ( "Dump" :keys "d"
  	 :type entry
  	 :template "* %?\n%U\n%a\n%i\n"
      	 :headline "Active"
      	 :empty-lines 1
  	 :file ,(plist-get ORG_FILES :dump)))))
;; =doct= and captures:1 ends here

;; [[file:../emacs-init.org::*=org-babel=][=org-babel=:1]]
(org-babel-do-load-languages
 'org-babel-load-languages
 '((emacs-lisp . t)
   (python . t)))

(setq org-confirm-babel-evaluate nil)
;; =org-babel=:1 ends here

;; [[file:../emacs-init.org::*=org-autolist=][=org-autolist=:1]]
(use-package org-autolist
  :hook
  (org-mode . org-autolist-mode))
;; =org-autolist=:1 ends here

;; [[file:../emacs-init.org::*=org-bullets=][=org-bullets=:1]]
(use-package org-bullets
  :after org

  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
;; =org-bullets=:1 ends here

;; [[file:../emacs-init.org::*=org-auto-tangle=][=org-auto-tangle=:1]]
(use-package org-auto-tangle
  :hook
  (org-mode . org-auto-tangle-mode))
;; =org-auto-tangle=:1 ends here

;; [[file:../emacs-init.org::*=org-appear=][=org-appear=:1]]
(use-package org-appear
  :hook
  (org-mode . org-appear-mode))
;; =org-appear=:1 ends here

;; [[file:../emacs-init.org::*=org-mime=][=org-mime=:1]]
(use-package org-mime
  ;; :hook
  ;; (message-send . org-mime-htmlize)
  :custom
  (org-mime-export-options '(:section-numbers nil :with-author nil :with-toc nil)))
;; =org-mime=:1 ends here
