export/emacs-init.el

;; [[file:../emacs-init.org::*=org-roam=][=org-roam=:1]]
(use-package org-roam
  :custom
  (org-roam-directory ORG_ROAM_DIR)
  (org-roam-completion-everywhere t)

  (org-roam-dailies-capture-templates
   `(("d" "default" entry "* %?" :target
      (file+head ,(concat "%<" DATE_FORMAT_FOR_SAVE ">.org") ,(concat "#+TITLE: Journal for " DATE_FORMAT "\n\n")))))

  (org-roam-dailies-directory ORG_ROAM_DAILIES_DIR)

  (org-roam-capture-templates
   `(("d" "default" plain "%?" :target
      (file+head ,(concat "%<" DATE_FORMAT_FOR_SAVE ">-${slug}.org") "#+TITLE: ${title}\n\n")
      :unnarrowed t)))

  :bind (("C-c n l" . org-roam-buffer-toggle)
       ("C-c n f" . org-roam-node-find)
       ("C-c n i" . org-roam-node-insert)
       :map org-mode-map
       ("C-M-i"    . completion-at-point))
  :config
  (org-roam-setup))
;; =org-roam=:1 ends here

;; [[file:../emacs-init.org::*=org-notifications=][=org-notifications=:1]]
(use-package org-notifications)
;; =org-notifications=:1 ends here

;; [[file:../emacs-init.org::*GPTel][GPTel:1]]
(use-package gptel)

(gptel-make-ollama "Ollama"
  :host "localhost:11434"
  :stream t
  :models '(gemma2:2b-instruct-q4_K_M llama3.2:3b qwen2.5:3b qwen2.5:0.5b))
;; GPTel:1 ends here

;; [[file:../emacs-init.org::*Company][Company:1]]
(use-package company
  :custom
  (company-idle-delay 0.5)
  ;; (company-begin-commands nil) ;; uncomment to disable popup
  :bind
  (:map company-active-map
        ("C-j". company-select-next)
        ("C-k". company-select-previous)
        ("C-h". company-select-first)
        ("C-l". company-select-last)))
;; Company:1 ends here

;; [[file:../emacs-init.org::*Yasnippet][Yasnippet:1]]
(use-package yasnippet
  :hook
  (prog-mode . yas-minor-mode)
  (text-mode . yas-minor-mode)

  :custom
  (yas-snippet-dirs (list YAS_SNIPPET_DIR))

  :config
  (yas-reload-all))
;; Yasnippet:1 ends here

;; [[file:../emacs-init.org::*Flycheck][Flycheck:1]]
(use-package flycheck)
;; Flycheck:1 ends here

;; [[file:../emacs-init.org::*LSP][LSP:1]]
(use-package lsp-mode
  :commands lsp
  :custom
  ;; what to use when checking on-save. "check" is default, I prefer clippy
  (lsp-rust-analyzer-cargo-watch-command "clippy")
  (lsp-eldoc-render-all t)
  (lsp-idle-delay 0.6)
  ;; enable / disable the hints as you prefer:
  (lsp-inlay-hint-enable t)
  ;; These are optional configurations. See https://emacs-lsp.github.io/lsp-mode/page/lsp-rust-analyzer/#lsp-rust-analyzer-display-chaining-hints for a full list
  ;; (lsp-rust-analyzer-display-lifetime-elision-hints-enable "skip_trivial")
  ;; (lsp-rust-analyzer-display-chaining-hints t)
  ;; (lsp-rust-analyzer-display-lifetime-elision-hints-use-parameter-names nil)
  ;; (lsp-rust-analyzer-display-closure-return-type-hints t)
  ;; (lsp-rust-analyzer-display-parameter-hints nil)
  ;; (lsp-rust-analyzer-display-reborrow-hints nil)
  :config
  (add-hook 'lsp-mode-hook 'lsp-ui-mode))

(use-package lsp-ui
  :commands lsp-ui-mode
  :custom
  (lsp-ui-peek-always-show t)
  (lsp-ui-sideline-show-hover t)
  (lsp-ui-doc-enable nil))
;; LSP:1 ends here

;; [[file:../emacs-init.org::*Projectile][Projectile:1]]
(use-package projectile
  :init
  (when (file-directory-p PROJECTS_DIR)
    (setq projectile-project-search-path (list PROJECTS_DIR)))
  (setq projectile-switch-project-action #'projectile-dired)

  :bind-keymap
  ("C-c p" . projectile-command-map)

  :custom
  (projectile-completion-system 'ivy)

  :config
  (projectile-mode))

(use-package counsel-projectile
  :after projectile

  :config
  (counsel-projectile-mode))

(use-package org-project-capture
  :bind
  (("C-c n p" . org-project-capture-project-todo-completing-read))

  :config
                                        ;(setq org-project-capture-backend
                                        ;      (make-instance 'org-project-capture-projectile-backend))
  (setq org-project-capture-projects-file ORG_PROJECT_CAPTURE_FILE)
  (org-project-capture-single-file))

(use-package org-projectile)
;; Projectile:1 ends here

;; [[file:../emacs-init.org::*Rust][Rust:1]]
(use-package rustic
  :bind
  (:map rustic-mode-map
        ("M-j" . lsp-ui-imenu)
        ("M-?" . lsp-find-references)
        ("C-c C-c l" . flycheck-list-errors)
        ("C-c C-c a" . lsp-execute-code-action)
        ("C-c C-c r" . lsp-rename)
        ("C-c C-c q" . lsp-workspace-restart)
        ("C-c C-c Q" . lsp-workspace-shutdown)
        ("C-c C-c s" . lsp-rust-analyzer-status))

  :custom
  (rustic-rustfmt-config-alist '((edition . "2021")))

  (lsp-eldoc-hook nil)
  (lsp-enable-symbol-highlighting nil)
  (lsp-signature-auto-activate nil)

  (rustic-format-on-save t))
;; Rust:1 ends here

;; [[file:../emacs-init.org::*YAML][YAML:1]]
(use-package yaml)
;; YAML:1 ends here

;; [[file:../emacs-init.org::*Python][Python:1]]
(use-package pyvenv)
;; Python:1 ends here

;; [[file:../emacs-init.org::*Miscalleneous packages][Miscalleneous packages:1]]
;; Log commands you typed.
(use-package command-log-mode)
;; Miscalleneous packages:1 ends here

;; [[file:../emacs-init.org::*Post-amble][Post-amble:1]]
(server-start)
;; Post-amble:1 ends here

;; [[file:../emacs-init.org::*Post-amble][Post-amble:2]]
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(auth-source-save-behavior nil)
 '(custom-safe-themes
   '("fbf73690320aa26f8daffdd1210ef234ed1b0c59f3d001f342b9c0bbf49f531c" default))
 '(package-selected-packages
   '(doct latex-preview-pane auctex LaTeX visual-fill-column org-bullets evil-org evil-collection evil-leader key-chord evil general all-the-icons helpful ivy-rich which-key rainbow-delimiters rainbow-delimeters modus-themes desktop-environment exwm-systemtray exwm-randr exwm mood-line powerline citar counsel ivy command-log-mode))
 '(pdf-latex-command "xelatex"))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
;; Post-amble:2 ends here
